---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.ConnectionInputPoint
source: html/fee5c389-ca1a-83b2-c48d-9efa750ccdf7.htm
---
# ConnectionInputPoint Members

Construct a default input point.